# Pipeline for cleaning and transformations

In [5]:
import pandas as pd
from sklearn.pipeline import Pipeline
import glob
import numpy as np
from sqlalchemy import create_engine
import pymysql
import sqlalchemy as db
#import MYSQLdb 
pymysql.install_as_MySQLdb()

In [10]:
! pip3 install mysql-connector-python-rf

Collecting mysql-connector-python-rf
  Downloading mysql-connector-python-rf-2.2.2.tar.gz (11.9 MB)
Building wheels for collected packages: mysql-connector-python-rf
  Building wheel for mysql-connector-python-rf (setup.py): started
  Building wheel for mysql-connector-python-rf (setup.py): finished with status 'done'
  Created wheel for mysql-connector-python-rf: filename=mysql_connector_python_rf-2.2.2-cp38-cp38-win_amd64.whl size=249453 sha256=d94732421106d2e013f63d28760085528fa0bfbc3114d94871194231440c4c7a
  Stored in directory: c:\users\boris\appdata\local\pip\cache\wheels\f5\66\87\6d9cef740fd440ef390930fdbe6c761dc1efef78ec94a288fd
Successfully built mysql-connector-python-rf
Installing collected packages: mysql-connector-python-rf
Successfully installed mysql-connector-python-rf-2.2.2

WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)

In [107]:
engine = db.create_engine("mysql+mysqlconnector://nVY8WCmoZ0:CM3Tfkrio8@remotemysql.com:3306/nVY8WCmoZ0") # mysqldb
engine.connect()

Variables:

* Income
* Age
* Sex
* Race
* Insurance


**Important note:**  summary level 50 should be used to have county fips

## Income variables

All refer to HOUSEHOLD INCOME IN THE PAST 12 MONTHS (IN 2016 INFLATION-ADJUSTED DOLLARS) for Households

* b19001_002: <10,000 
* b19001_003: 10,000 ~ 14,999
* b19001_004: 15,000 ~ 19,999
* b19001_005: 20,000 ~ 24,999
* b19001_006: 25,000 ~ 29,999
* b19001_007: 30,000 ~ 34,999
* b19001_008: 35,000 ~ 39,999
* b19001_009: 40,000 ~ 44,999
* b19001_010: 45,000 ~ 49,999
* b19001_011: 50,000 ~ 59,999
* b19001_012: 60,000 ~ 74,999
* b19001_013: 75,000 ~ 99,999
* b19001_014: 100,000 ~ 124,999
* b19001_015: 125,000 ~ 149,999
* b19001_016: 150,000 ~ 199,999
* b19001_017: 200,000+

This are the variables that we're going to use for our analysis. Other features are not going to be eliminated

In [13]:
def raw_data_all_states(folder):
    raw_data=glob.glob(f'{folder}/*.csv')
    feature=pd.DataFrame()
    for f in raw_data:
        file = pd.DataFrame(pd.read_csv(f,low_memory=False))
        file=file.loc[file['SummaryLevel'] == 50]
        feature=feature.append(file)
        
    return feature

In [14]:
income_raw=raw_data_all_states('Income')

In [15]:

def income_cleaning(state_raw):
    income_cols = ['AreaName', 'State']
    income_codes1 = 'B19001_00'
    income_codes2 = 'B19001_0'
    for i in range (2,10):
        income_cols.append(income_codes1 + str(i))

    for i in range(10,18):
        income_cols.append(income_codes2 + str(i))

    x = state_raw.loc[:,income_cols]  
    return x

In [52]:
cleaned_data = income_cleaning(income_raw)

In [53]:
def change_names_income(state):
    cols_rename = {
                'B19001_002': '<10k',
                'B19001_003': '10k ~ 14,999',
                'B19001_004': '15k ~ 19,999',
                'B19001_005': '20k ~ 24,999',
                'B19001_006': '25k ~ 29,999',
                'B19001_007': '30k ~ 34,999',
                'B19001_008': '35k ~ 39,999',
                'B19001_009': '40k ~ 44,999',
                'B19001_010': '45k ~ 49,999',
                'B19001_011': '50k ~ 59,999',
                'B19001_012': '60k ~ 74,999',
                'B19001_013': '75k ~ 99,999',
                'B19001_014': '100k ~ 124,999',
                'B19001_015': '125k ~ 149,999',
                'B19001_016': '150k ~ 199,999',
                'B19001_017': '200k+'
                }
    state.rename(columns = cols_rename, inplace = True)
    
    return state

In [54]:
Cleaned_income=change_names_income(cleaned_data)

In [55]:
Cleaned_income.head(1)

,AreaName,State,<10k,"10k ~ 14,999","15k ~ 19,999","20k ~ 24,999","25k ~ 29,999","30k ~ 34,999","35k ~ 39,999","40k ~ 44,999","45k ~ 49,999","50k ~ 59,999","60k ~ 74,999","75k ~ 99,999","100k ~ 124,999","125k ~ 149,999","150k ~ 199,999",200k+
12,"Aleutians East Borough, Alaska",AK,27,36,33,48,31,26,23,27,30,70,102,123,75,48,56,33

In [56]:
def county_cleaning(df):
    df['AreaName'] = df['AreaName'].replace({'County,':''}, regex=True)
    return df

In [57]:
last_income = county_cleaning(Cleaned_income)

In [58]:
last_income.head(1)

,AreaName,State,<10k,"10k ~ 14,999","15k ~ 19,999","20k ~ 24,999","25k ~ 29,999","30k ~ 34,999","35k ~ 39,999","40k ~ 44,999","45k ~ 49,999","50k ~ 59,999","60k ~ 74,999","75k ~ 99,999","100k ~ 124,999","125k ~ 149,999","150k ~ 199,999",200k+
12,"Aleutians East Borough, Alaska",AK,27,36,33,48,31,26,23,27,30,70,102,123,75,48,56,33

In [59]:
last_income = pd.melt(last_income, id_vars=['AreaName', 'State'], value_vars=['<10k', '10k ~ 14,999', '15k ~ 19,999', '20k ~ 24,999', '25k ~ 29,999', '30k ~ 34,999', '35k ~ 39,999', '40k ~ 44,999', '45k ~ 49,999', '50k ~ 59,999', '60k ~ 74,999', '75k ~ 99,999', '100k ~ 124,999', '125k ~ 149,999', '150k ~ 199,999', '200k+'], ignore_index=True)

In [60]:
last_income.rename(columns = {'variable':'IncomeVar', 'value':'IncomeValue'}, inplace = True)
last_income.head()

                             AreaName State IncomeVar  IncomeValue
0      Aleutians East Borough, Alaska    AK      <10k           27
1  Aleutians West Census Area, Alaska    AK      <10k           30
2      Anchorage Municipality, Alaska    AK      <10k         2934
3          Bethel Census Area, Alaska    AK      <10k          299
4         Bristol Bay Borough, Alaska    AK      <10k           13

In [63]:
with engine.begin() as connection:
        last_income.to_sql('income', con=connection, schema='nVY8WCmoZ0', if_exists='replace', index=False)

InvalidRequestError: Could not reflect: requested table(s) not available in Engine(mysql+mysqlconnector://nVY8WCmoZ0:***@remotemysql.com:3306/nVY8WCmoZ0) schema 'nVY8WCmoZ0': (income)

In [14]:
i_check = pd.read_sql_table("income", engine)
i_check.head()

                             AreaName State IncomeVar  IncomeValue
0      Aleutians East Borough, Alaska    AK      <10k           27
1  Aleutians West Census Area, Alaska    AK      <10k           30
2      Anchorage Municipality, Alaska    AK      <10k         2934
3          Bethel Census Area, Alaska    AK      <10k          299
4         Bristol Bay Borough, Alaska    AK      <10k           13

Este es el resultado que buscamos replicar en todas las tablas, tener solo los códigos que elegimos y reemplazarlos por el valor.

## Age & Sex variables

This features refer to SEX BY AGE for Total Population (Male)

* b01001_003: <5
* b01001_004: 5 ~ 9
* b01001_005: 10 ~ 14
* b01001_006: 15 ~ 17
* b01001_007: 18 ~ 19
* b01001_008: 20
* b01001_009: 21
* b01001_010: 22 ~ 24
* b01001_011: 25 ~ 29
* b01001_012: 30 ~ 34
* b01001_013: 35 ~ 39
* b01001_014: 40 ~ 44
* b01001_015: 45 ~ 49
* b01001_016: 50 ~ 54
* b01001_017: 55 ~ 59
* b01001_018: 60 ~ 61
* b01001_019: 62 ~ 64
* b01001_020: 65 ~ 66
* b01001_021: 67 ~ 69
* b01001_022: 70 ~ 74
* b01001_023: 75 ~ 79
* b01001_024: 80 ~ 84
* b01001_025: 85+

This features refer to SEX BY AGE for Total Population (Female)

* b01001_027: <5
* b01001_028: 5 ~ 9
* b01001_029: 10 ~ 14
* b01001_030: 15 ~ 17
* b01001_031: 18 ~ 19
* b01001_032: 20
* b01001_033: 21
* b01001_034: 22 ~ 24
* b01001_035: 25 ~ 29
* b01001_036: 30 ~ 34
* b01001_037: 35 ~ 39
* b01001_038: 40 ~ 44
* b01001_039: 45 ~ 49
* b01001_040: 50 ~ 54
* b01001_041: 55 ~ 59
* b01001_042: 60 ~ 61
* b01001_043: 62 ~ 64
* b01001_044: 65 ~ 66
* b01001_045: 67 ~ 69
* b01001_046: 70 ~ 74
* b01001_047: 75 ~ 79
* b01001_048: 80 ~ 84
* b01001_049: 85+

In [64]:
age_sex_raw = raw_data_all_states('Age_sex')

In [65]:

def age_sex_cleaning(state_raw):
    age_sex_cols =['AreaName', 'State']
    age_sex_male1 = 'B01001_00'
    age_sex_male2 = 'B01001_0'
    age_sex_female = 'B01001_0'
    for i in range (3,10):
        age_sex_cols.append(age_sex_male1 + str(i))
    for i in range (10,26):
        age_sex_cols.append(age_sex_male2 + str(i))
        
    
    for i in range (27,50):
        age_sex_cols.append(age_sex_female + str(i))

    x = state_raw.loc[:,age_sex_cols]  
    return x

In [66]:
cleaned_age_sex = age_sex_cleaning(age_sex_raw)

In [67]:
cleaned_age_sex.head(1)

,AreaName,State,B01001_003,B01001_004,B01001_005,B01001_006,B01001_007,B01001_008,B01001_009,B01001_010,...,B01001_040,B01001_041,B01001_042,B01001_043,B01001_044,B01001_045,B01001_046,B01001_047,B01001_048,B01001_049
12,"Aleutians East Borough, Alaska",AK,48,71,74,30,42,36,20,141,...,129,113,26,50,37,18,14,13,7,10

In [68]:
def change_names_age_sex(state):
    cols_rename = {
                'B01001_003': 'Male <5',
                'B01001_004': 'Male 5 ~ 9',
                'B01001_005': 'Male 10 ~ 14',
                'B01001_006': 'Male 15 ~ 17',
                'B01001_007': 'Male 18 ~ 19',
                'B01001_008': 'Male 20',
                'B01001_009': 'Male 21',
                'B01001_010': 'Male 22 ~ 24',
                'B01001_011': 'Male 25 ~ 29',
                'B01001_012': 'Male 30 ~ 34',
                'B01001_013': 'Male 35 ~ 39',
                'B01001_014': 'Male 40 ~ 44',
                'B01001_015': 'Male 45 ~ 49',
                'B01001_016': 'Male 50  ~ 54',
                'B01001_017': 'Male 55 ~ 59',
                'B01001_018': 'Male 60 ~ 61',
                'B01001_019': 'Male 62 ~ 64',
                'B01001_020': 'Male 65 ~ 66',
                'B01001_021': 'Male 67 ~ 69',
                'B01001_022': 'Male 70 ~ 74',
                'B01001_023': 'Male 75 ~ 79',
                'B01001_024': 'Male 80 ~ 84',
                'B01001_025': 'Male 85 +',
                'B01001_027': 'Female <5',
                'B01001_028': 'Female 5 ~ 9',
                'B01001_029': 'Female 10 ~ 14',
                'B01001_030': 'Female 15 ~ 17',
                'B01001_031': 'Female 18 ~ 19',
                'B01001_032': 'Female 20',
                'B01001_033': 'Female 21',
                'B01001_034': 'Female 22 ~ 24',
                'B01001_035': 'Female 25 ~ 29',
                'B01001_036': 'Female 30 ~ 34',
                'B01001_037': 'Female 35 ~ 39',
                'B01001_038': 'Female 40 ~ 44',
                'B01001_039': 'Female 45 ~ 49',
                'B01001_040': 'Female 50 ~ 54',
                'B01001_041': 'Female 55 ~ 59',
                'B01001_042': 'Female 60 ~ 61',
                'B01001_043': 'Female 62 ~ 64',
                'B01001_044': 'Female 65 ~ 66',
                'B01001_045': 'Female 67 ~ 69',
                'B01001_046': 'Female 70 ~ 74',
                'B01001_047': 'Female 75 ~ 79',
                'B01001_048': 'Female 80 ~ 84',
                'B01001_049': 'Female 85+'
                }
    state.rename(columns = cols_rename, inplace = True)
    
    return state

In [69]:
ags = change_names_age_sex(cleaned_age_sex)

In [70]:
def groupby_age (df):
    x=df['State']
    areaname =df['AreaName']
    x1=df["Male <5"] + df["Female <5"]
    x2=df['Male 5 ~ 9'] + df['Female 5 ~ 9']
    x3=df['Male 10 ~ 14'] + df['Female 10 ~ 14']
    x4=df['Male 15 ~ 17'] + df['Female 15 ~ 17']
    x5=df['Male 18 ~ 19'] + df['Female 18 ~ 19']
    x6=df['Male 20'] + df['Female 20']
    x7=df['Male 21'] + df['Female 21']
    x8=df['Male 22 ~ 24'] + df['Female 22 ~ 24']
    x9=df['Male 25 ~ 29'] + df['Female 25 ~ 29']
    x10=df['Male 30 ~ 34'] + df['Female 30 ~ 34']
    x11=df['Male 35 ~ 39'] + df['Female 35 ~ 39']
    x12=df['Male 40 ~ 44'] + df['Female 40 ~ 44']
    x13=df['Male 45 ~ 49'] + df['Female 45 ~ 49']
    x14=df['Male 50  ~ 54'] + df['Female 50 ~ 54']
    x15=df['Male 55 ~ 59'] + df['Female 55 ~ 59']
    x16=df['Male 60 ~ 61'] + df['Female 60 ~ 61']
    x17=df['Male 62 ~ 64'] + df['Female 62 ~ 64']
    x18=df['Male 65 ~ 66'] + df['Female 65 ~ 66']
    x19=df['Male 67 ~ 69'] + df['Female 67 ~ 69']
    x20=df['Male 70 ~ 74'] + df['Female 70 ~ 74']
    x21=df['Male 75 ~ 79'] + df['Female 75 ~ 79']
    x22=df['Male 80 ~ 84'] + df['Female 80 ~ 84']
    x23=df['Male 85 +'] + df['Female 85+']
    
    df1 = pd.DataFrame(list(zip(x,areaname,x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23)), 
                       columns=['State','AreaName','<5','5~9','10~14','15~17','18~19','20','21','22~24','25~29','30~34','35~39','40~44','45~49','50~54','55~59','60~61','62~64','65~66','67~69','70~74','75~79','80~84','85+'])


    return df1

In [71]:
def groupby_sex(df):
    x=df['State']
    areaname =df['AreaName']
    male=df["Male <5"] +df['Male 5 ~ 9'] +df['Male 10 ~ 14'] +df['Male 15 ~ 17']+df['Male 18 ~ 19'] +df['Male 20'] +df['Male 21'] +df['Male 22 ~ 24'] +df['Male 25 ~ 29'] +df['Male 30 ~ 34'] +df['Male 35 ~ 39'] +df['Male 40 ~ 44'] +df['Male 45 ~ 49'] +df['Male 50  ~ 54'] +df['Male 55 ~ 59'] +df['Male 60 ~ 61'] +df['Male 62 ~ 64'] +df['Male 65 ~ 66'] +df['Male 67 ~ 69'] +df['Male 70 ~ 74'] +df['Male 75 ~ 79'] +df['Male 80 ~ 84'] +df['Male 85 +'] 
    female= df["Female <5"]+ df['Female 5 ~ 9']+ df['Female 10 ~ 14']+ df['Female 15 ~ 17']+ df['Female 18 ~ 19']+ df['Female 20']+ df['Female 21']+ df['Female 22 ~ 24']+ df['Female 25 ~ 29']+ df['Female 30 ~ 34']+ df['Female 35 ~ 39']+ df['Female 40 ~ 44']+ df['Female 45 ~ 49']+ df['Female 50 ~ 54']+ df['Female 55 ~ 59']+ df['Female 60 ~ 61']+ df['Female 62 ~ 64']+ df['Female 65 ~ 66']+ df['Female 67 ~ 69']+ df['Female 70 ~ 74']+ df['Female 75 ~ 79']+ df['Female 80 ~ 84']+ df['Female 85+']
    df1 = pd.DataFrame(list(zip(x,areaname,male,female)),columns=['State','AreaName','TotalMen','TotalFemale'])
    # df2 = pd.DataFrame(list(zip,x,areaname,male)),columns=['State','AreaName','TotalWomen']
    return df1

In [72]:
sex = groupby_sex(ags)
sex.head(1)

  State                        AreaName  TotalMen  TotalFemale
0    AK  Aleutians East Borough, Alaska      2145         1154

In [73]:
last_sex = county_cleaning(sex)

In [74]:
last_sex.head(1)

  State                        AreaName  TotalMen  TotalFemale
0    AK  Aleutians East Borough, Alaska      2145         1154

In [75]:
last_sex = pd.melt(last_sex, id_vars=['AreaName', 'State'], value_vars=['TotalMen', 'TotalFemale'], ignore_index=True)

In [76]:
last_sex.rename(columns = {'variable':'SexVar', 'value':'SexValue'}, inplace = True)
last_sex.head()

                             AreaName State    SexVar  SexValue
0      Aleutians East Borough, Alaska    AK  TotalMen      2145
1  Aleutians West Census Area, Alaska    AK  TotalMen      3578
2      Anchorage Municipality, Alaska    AK  TotalMen    152681
3          Bethel Census Area, Alaska    AK  TotalMen      9358
4         Bristol Bay Borough, Alaska    AK  TotalMen       536

In [77]:
with engine.begin() as connection:
        last_sex.to_sql('sex', con=connection, schema='nVY8WCmoZ0', if_exists='replace', index=False)

OperationalError: (mysql.connector.errors.OperationalError) MySQL Connection not available.
[SQL: SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s]
[parameters: [{'table_schema': 'nVY8WCmoZ0', 'table_name': 'sex'}]]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [46]:
s_check = pd.read_sql_table("sex", engine)
s_check.head()

                             AreaName State    SexVar  SexValue
0      Aleutians East Borough, Alaska    AK  TotalMen      2145
1  Aleutians West Census Area, Alaska    AK  TotalMen      3578
2      Anchorage Municipality, Alaska    AK  TotalMen    152681
3          Bethel Census Area, Alaska    AK  TotalMen      9358
4         Bristol Bay Borough, Alaska    AK  TotalMen       536

In [78]:
age = groupby_age(ags)
age.head(1)

,State,AreaName,<5,5~9,10~14,15~17,18~19,20,21,22~24,...,50~54,55~59,60~61,62~64,65~66,67~69,70~74,75~79,80~84,85+
0,AK,"Aleutians East Borough, Alaska",93,117,129,68,57,43,37,210,...,382,295,74,166,67,56,33,23,20,21

In [79]:
last_age = county_cleaning(age)

In [80]:
last_age.head(1)

,State,AreaName,<5,5~9,10~14,15~17,18~19,20,21,22~24,...,50~54,55~59,60~61,62~64,65~66,67~69,70~74,75~79,80~84,85+
0,AK,"Aleutians East Borough, Alaska",93,117,129,68,57,43,37,210,...,382,295,74,166,67,56,33,23,20,21

In [81]:
last_age = pd.melt(last_age, id_vars=['State', 'AreaName'], value_vars=['<5','5~9','10~14', '15~17', '18~19', '20', '21', '22~24', '25~29', '30~34', '35~39', '40~44', '45~49', '50~54', '55~59', '60~61', '62~64', '65~66', '67~69', '70~74', '75~79', '80~84', '85+'], ignore_index=True)

In [82]:
last_age.rename(columns = {'variable':'AgeVar', 'value':'AgeValue'}, inplace = True)
last_age.head()

  State                            AreaName AgeVar  AgeValue
0    AK      Aleutians East Borough, Alaska     <5        93
1    AK  Aleutians West Census Area, Alaska     <5       190
2    AK      Anchorage Municipality, Alaska     <5     22121
3    AK          Bethel Census Area, Alaska     <5      1883
4    AK         Bristol Bay Borough, Alaska     <5        50

In [83]:
with engine.begin() as connection:
        last_age.to_sql('age', con=connection, schema='nVY8WCmoZ0', if_exists='replace', index=False)

InvalidRequestError: Could not reflect: requested table(s) not available in Engine(mysql+mysqlconnector://nVY8WCmoZ0:***@remotemysql.com:3306/nVY8WCmoZ0) schema 'nVY8WCmoZ0': (age)

In [51]:
a_check = pd.read_sql_table("age", engine)
a_check.head()

  State                            AreaName AgeVar  AgeValue
0    AK      Aleutians East Borough, Alaska     <5        93
1    AK  Aleutians West Census Area, Alaska     <5       190
2    AK      Anchorage Municipality, Alaska     <5     22121
3    AK          Bethel Census Area, Alaska     <5      1883
4    AK         Bristol Bay Borough, Alaska     <5        50

## Race variable

This features refer to RACE for Total Population

* b02001_002: White alone
* b02001_003: Black or African American alone
* b02001_004: American Indian and Alaska Native alone
* b02001_005: Asian alone
* b02001_006: Native Hawaiian and Other Pacific Islander alone
* b02001_007: Some other race alone
* b02001_008: Two or more races

In [84]:
race_raw = raw_data_all_states('Race')

In [85]:
def race_cleaning(state_raw):
    race_cols =['State', 'AreaName']
    race = 'B02001_00'
    for i in range (2,9):
        race_cols.append(race + str(i))
        
    x = state_raw.loc[:,race_cols]
    return x

In [86]:
cleaned_race = race_cleaning(race_raw)

In [87]:
def change_names_race(state):
    cols_rename = {
         'B02001_002': 'White alone',
         'B02001_003': 'Black or African American alone',
         'B02001_004': 'American Indian and Alaska Native alone',
         'B02001_005': 'Asian alone',
         'B02001_006': 'Native Hawaiian and Other Pacific Islander alone',
         'B02001_007': 'Some other race alone',
         'B02001_008': 'Two or more races'
        
    }
    
    state.rename(columns = cols_rename,inplace=True)
    
    return state

In [88]:
cleaned_race_final = change_names_race(cleaned_race)
cleaned_race_final.head(1)

,State,AreaName,White alone,Black or African American alone,American Indian and Alaska Native alone,Asian alone,Native Hawaiian and Other Pacific Islander alone,Some other race alone,Two or more races
12,AK,"Aleutians East Borough, Alaska",630,231,1119,974,36,134,175

In [90]:
last_race= county_cleaning(cleaned_race_final)

In [91]:
last_race = pd.melt(last_race, id_vars=['AreaName', 'State'], value_vars=['White alone', 'Black or African American alone', 'American Indian and Alaska Native alone', 'Asian alone', 'Native Hawaiian and Other Pacific Islander alone', 'Some other race alone', 'Two or more races'], ignore_index=True)

In [92]:
last_race.rename(columns = {'variable':'RaceVar', 'value':'RaceValue'}, inplace = True)
last_race.head()

                             AreaName State      RaceVar  RaceValue
0      Aleutians East Borough, Alaska    AK  White alone        630
1  Aleutians West Census Area, Alaska    AK  White alone       1763
2      Anchorage Municipality, Alaska    AK  White alone     192329
3          Bethel Census Area, Alaska    AK  White alone       1976
4         Bristol Bay Borough, Alaska    AK  White alone        525

In [93]:
with engine.begin() as connection:
        last_race.to_sql('race', con=connection, schema='nVY8WCmoZ0', if_exists='replace', index=False)

InvalidRequestError: Could not reflect: requested table(s) not available in Engine(mysql+mysqlconnector://nVY8WCmoZ0:***@remotemysql.com:3306/nVY8WCmoZ0) schema 'nVY8WCmoZ0': (race)

In [60]:
r_check = pd.read_sql_table("race", engine)
r_check.head()

                             AreaName State      RaceVar  RaceValue
0      Aleutians East Borough, Alaska    AK  White alone        630
1  Aleutians West Census Area, Alaska    AK  White alone       1763
2      Anchorage Municipality, Alaska    AK  White alone     192329
3          Bethel Census Area, Alaska    AK  White alone       1976
4         Bristol Bay Borough, Alaska    AK  White alone        525

## Health insurance variable

* b27001_001: HEALTH INSURANCE COVERAGE
* b27002_001: PRIVATE HEALTH INSURANCE
* b27003_001: PUBLIC HEALTH INSURANCE
* c27004_001: EMPLOYER-BASED HEALTH INSURANCE 
* c27005_001: DIRECT-PURCHASE HEALTH INSURANCE
* c27006_001: MEDICARE COVERAGE
* c27007_001: MEDICAID/MEANS-TESTED PUBLIC COVERAGE
* c27008_001: TRICARE/MILITARY HEALTH COVERAGE
* c27009_001: VA HEALTH CARE

In [94]:
healthcare_raw = raw_data_all_states('Health_insurance')

In [95]:
def healthcare_cleaning(state_raw):

    insurance_cols =['AreaName', 'State']
    insurance_b = 'B2700'
    insurance_c = 'C2700'
    finish= '_001'
    for i in range (1,4):
        insurance_cols.append(insurance_b + str(i) + finish)
    for i in range (4,10):
        insurance_cols.append(insurance_c + str(i) + finish)
        
    x = state_raw.loc[:,insurance_cols]
    return x

In [96]:
cleaned_healthcare = healthcare_cleaning(healthcare_raw)

In [97]:
def change_names_healthcare(state):
    cols_rename = {
        'B27001_001': 'HEALTH INSURANCE COVERAGE',
        'B27002_001': 'PRIVATE HEALTH INSURANCE',
        'B27003_001': 'PUBLIC HEALTH INSURANCE',
        'C27004_001': 'EMPLOYER-BASED HEALTH INSURANCE',
        'C27005_001': 'DIRECT-PURCHASE HEALTH INSURANCE',
        'C27006_001': 'MEDICARE COVERAGE',
        'C27007_001': 'MEDICAID/MEANS-TESTED PUBLIC COVERAGE',
        'C27008_001': 'TRICARE/MILITARY HEALTH COVERAGE',
        'C27009_001': 'VA HEALTH CARE'
    }
    state.rename(columns= cols_rename, inplace=True)
    return state

In [98]:
Cleaned_healthcare_final = change_names_healthcare(cleaned_healthcare)

In [99]:
Cleaned_healthcare_final.head(1)

,AreaName,State,HEALTH INSURANCE COVERAGE,PRIVATE HEALTH INSURANCE,PUBLIC HEALTH INSURANCE,EMPLOYER-BASED HEALTH INSURANCE,DIRECT-PURCHASE HEALTH INSURANCE,MEDICARE COVERAGE,MEDICAID/MEANS-TESTED PUBLIC COVERAGE,TRICARE/MILITARY HEALTH COVERAGE,VA HEALTH CARE
12,"Aleutians East Borough, Alaska",AK,3294,3294,3294,3294,3294,3294,3294,3294,3294

In [101]:
last_healthcare= county_cleaning(Cleaned_healthcare_final)

In [102]:
last_healthcare = pd.melt(last_healthcare, id_vars=['AreaName', 'State'], value_vars=['HEALTH INSURANCE COVERAGE', 'PRIVATE HEALTH INSURANCE', 'PUBLIC HEALTH INSURANCE', 'EMPLOYER-BASED HEALTH INSURANCE', 'DIRECT-PURCHASE HEALTH INSURANCE', 'MEDICARE COVERAGE', 'MEDICAID/MEANS-TESTED PUBLIC COVERAGE', 'TRICARE/MILITARY HEALTH COVERAGE', 'VA HEALTH CARE'], ignore_index=True)

In [103]:
last_healthcare.rename(columns = {'variable':'HealthcareVar', 'value':'HealthcareValue'}, inplace = True)
last_healthcare.head()

,AreaName,State,HealthcareVar,HealthcareValue
0,"Aleutians East Borough, Alaska",AK,HEALTH INSURANCE COVERAGE,3294
1,"Aleutians West Census Area, Alaska",AK,HEALTH INSURANCE COVERAGE,5544
2,"Anchorage Municipality, Alaska",AK,HEALTH INSURANCE COVERAGE,288250
3,"Bethel Census Area, Alaska",AK,HEALTH INSURANCE COVERAGE,17585
4,"Bristol Bay Borough, Alaska",AK,HEALTH INSURANCE COVERAGE,927

In [104]:
with engine.begin() as connection:
        last_healthcare.to_sql('healthcare', con=connection, schema='nVY8WCmoZ0', if_exists='replace', index=False)

InvalidRequestError: Could not reflect: requested table(s) not available in Engine(mysql+mysqlconnector://nVY8WCmoZ0:***@remotemysql.com:3306/nVY8WCmoZ0) schema 'nVY8WCmoZ0': (healthcare)

In [83]:
h_check = pd.read_sql_table("healthcare", engine)
h_check.head()

,AreaName,State,HealthcareVar,HealthcareValue
0,"Aleutians East Borough, Alaska",AK,HEALTH INSURANCE COVERAGE,3294
1,"Aleutians West Census Area, Alaska",AK,HEALTH INSURANCE COVERAGE,5544
2,"Anchorage Municipality, Alaska",AK,HEALTH INSURANCE COVERAGE,288250
3,"Bethel Census Area, Alaska",AK,HEALTH INSURANCE COVERAGE,17585
4,"Bristol Bay Borough, Alaska",AK,HEALTH INSURANCE COVERAGE,927